Repository: g3w-suite/g3w-admin
Catalog: g3w-admin/caching/locale/*/LC_MESSAGES/django.po
Languages: it

source: Active
it: Attivo

source: Save as base layer
it: Salva come Base layer

source: Base layer title
it: Titolo Base layer

source: Base layer description
it: Descizione Base layer

source: Base layer attribution
it: Attribuzione/Copyright Base layer

source: Check on uncheck to activate/deactivate caching layer capabilities:
it: Attiva o disattiva il caching del layer

source: Reset cache
it: Cancella la cache del layer

source: Base layer data
it: Dati Base layer

source: This field is required
it: Campo obbligatorio

source: Alert
it: Attenzione

source: Some errors on form. Check it and send again.
it: Si nono verificati alcuni errori. Controlla e riprova.

source: Caching layer
it: Cache del layer

source: Activation layer caching
it: Attivazione cache del layer

source: Cache erased!
it: Cache eliminata!
