Repository: g3w-suite/g3w-admin
Catalog: g3w-admin/usersmanage/locale/*/LC_MESSAGES/django.po
Languages: it

source: Editor1 user
it: Utente Editor1

source: Set Editor Level 1 owner
it: Imposta il proprietario dell'Editor1

source: Editor2 user
it: Utente Editor2

source: Viewer users
it: Utenti Viewers

source: Editor user groups
it: Gruppi di utenti Editor

source: Viewer user groups
it: Gruppi di utenti Viewer

source: Propagate <b>NEW</b> viewers and new viewers user groups permissions
it: Propaga i permessi dei <b>NUOVI</b> utenti viewer e gruppi di utenti viewer aggiunti

source: Select roles for this user
it: Seleziona i gruppi principali per questo utente

source: Main roles
it: Ruoli principali

source: User viewer groups
it: Gruppi di utenti viewers

source: Anagraphic
it: Anagrafica

source: ACL/Roles
it: ACL/Ruoli

source: Login data
it: Dati di accesso

source: User data
it: Dati utente

source: User backend
it: Backend utente

source: User can't be Editor level 1 and at same time Editor level 2
it: L'utente non può essere allo stesso tempo Editor level 1 e Editor level 2</b>

source: User can't belong a **editor groups** if he isn't a Editor level 2
it: L'utente non può appartenere ad un edito group se non è un Editor level 2</b>

source: User can't belong a **viewer groups** if he isn't a Viewer level 1
it: L'utente non può appartenere a un viewer group se non è un Viewer level 1</b>

source: Avatar is no a valid image
it: Questo avatar non è una immagine

source: A user with that email already exists.
it: Un utente con la stessa email è già presente.

source: Password confirmation
it: Conferma password

source: Enter the same password as above, for verification.
it: Inserisci la stessa passoword indicata sopra per verifica.

source: Role
it: Ruolo

source: Users
it: Utenti

source: Group
it: Gruppo

source: User {user} has not role {cop_role}
it: L'utente {user} non il ruolo {cop_role}

source: Other informations
it: Altre informazioni

source: No user is available with this email.
it: Nessun utente è disponibile con questa email.

source: Registered user
it: Utente registrato

source: User activated by administrator
it: Utente attivato dall'amministratore

source: User changed password at first login
it: L'utente ha cambiato la password al primo accesso

source: Group role
it: Ruolo del gruppo

source: Dear
it: Caro

source: your profile was activated by administrators
it: il tuo profilo è stato attivato dagli amministratori del sistema

source: Now you can make the login
it: Ora puoi procedere con il login

source: your account is active
it: il tuo account è attivo

source: Dear administrator
it: Caro amministratore

source: a new user has registered, to activate the new user, follow or copy the link in your browser
it: un nuovo utente si è registrato, per attivarlo segui o copia il seguente link su tuo browser

source: New registration by
it: Nuova registrazione da

source: Activation Complete!
it: Attivazione completa!

source: Your account is active
it: Il tuo account è attivo

source: Now you can make the
it: Ora puoi eseguire

source: please got to the following link or copy it and paste in you browser to activate your account and validate your email
it: per favore segui o copia il segutne link dentro al tuo browser perattivare il tuo account e validare la tua email

source: The link will be active for
it: Il link sarà attivo per

source: days
it: giorni

source: active your account
it: attiva il tuo account

source: Activation Failed!
it: Attivazione Fallita!

source: An error occurred activation of your account
it: Un errore è avvenuto durante l'attivazione del tuo account

source: Sorry but the registration is closed!
it: Spiacente ma la registrazione è chiusa!

source: Registration complete!
it: Registrazione completa!

source: Your registration is being examined by the administrators, once your account is activated you will receive an activation confirmation email.
it: La tua registrazione sarà esaminata dagli amministratori, una volta che il tuo account è attivo riceverai una email di conferma attivazione.

source: You will receive a mail with a link to activate you account and validate your email.
it: Riceverai una email con un link per attivare il tuo account e validare la tua email.

source: ERROR
it: ERRORE

source: Sign Up
it: Registrati

source: User
it: Utente

source: System users
it: Utenti di sistema

source: Alert
it: Attenzione

source: Some errors on form. Check it and send again.
it: Si sono verificati alcuni errori. Controlla e reinvia.

source: User groups
it: Gruppi di utenti

source: User group
it: Gruppo di utenti

source: Actions
it: Azioni

source: Name
it: Nome

source: Created
it: Creato

source: Show detail
it: Mostra i dettagli

source: Edit
it: Modifica

source: Delete
it: Elimina

source: Roles
it: Ruoli

source: Macro groups
it: Macro gruppi

source: Superuser
it: Super utente

source: First name
it: Nome

source: Last name
it: Cognome

source: ACL Users
it: ACL Utenti

source: No %(verbose_name)s found matching the query
it: Nessun %(verbose_name)s trovato corrispondente alla query

source: Username recovery
it: Recupero utente

source: Username sent
it: Utente inviato
