Repository: g3w-suite/g3w-admin
Catalog: docs/locales/*/LC_MESSAGES/install.po
Languages: it

source: Raw installation
it: Istallazione classica

source: The following instructions are for a Ubuntu 18.04 LTS.
it: Le seguenti istruzioni sono basate su sistema operativo Ubuntu 18.04 LTS.

source: Installation of node.js and Yarn
it: Installazione di node.js e Yarn

source: G3W-ADMIN use javacript package manager Yarn and Node.js
it: G3W-ADMIN usa il gestore di pacchetti javacript [Yarn](https://yarnpkg.com/) e [Node.js](https://nodejs.org/it/)

source: for install Yarn follow main installation instructions:
it: per l'installazione di Yarn, seguire le istruzioni disponibili qui:

source: Create virtualenv
it: Creazione di una virtualenv

source: Virtualenv
it: [Virtualenv](https://virtualenv.pypa.io/en/stable/)

source: The following instructions are for python 3.6
it: Le seguenti istruzioni sono basate su Python versione 3.6

source: Install python pip
it: Installa python pip

source: now we can install virtualenvwrapper
it: ora possiamo installare virtualenvwrapper

source: To activate virtuenvwrapper on system login, add follow lines to 'bashrc' config file of your user
it: Per attivare virtuenvwrapper all'accesso al sistema, aggiungi le seguenti righe al file di configurazione 'bashrc' del tuo utente

source: Virtualenv creation
it: Creazione di Virtualenv

source: Install G3W-SUITE
it: Installazione di G3W-SUITE

source: First step is install dev libraries packages for python module to install with requiriments.txt
it: Il primo passo è installare i pacchetti di librerie di sviluppo per il modulo python da installare con requiriments.txt

source: after is necessary install the correct python module for GDAL library, check your version and install correct module
it: dopo è necessario installare il modulo python corretto per la libreria GDAL, controllare la versione e installare il modulo corretto

source: Set local_config.py file
it: Impostiamo il file local_config.py

source: G3W-ADMIN is a Django application, and to work is necessary set a config.py file. To start copy local_settings.example.py and set the databse and other:
it: G3W-ADMIN è un'applicazione Django e per funzionare è necessario impostare un file config.py. Per iniziare copiamo il file local_settings.example.py, impostiamo il database e settiamo le altre configurazioni:

source: set database, media root and session cookies name:
it: imposta il nome del database, la media root e il nome della sessione dei cookies:

source: With paver commands
it: Con comandi paver

source: G3W-ADMIN has a series of paver CLI commands to administrate the suite. After prepared environment if sufficient invoce paver install task
it: G3W-ADMIN ha una serie di comandi [paver](http://pythonhosted.org/Paver/) CLI per amministrare la suite. Dopo aver preparato l'ambiente è sufficiente invocare paver install task

source: Run G3W-SUITE
it: Avviare G3W-SUITE

source: To run the application with paver
it: Per eseguire l'applicazione con paver

source: and for stop
it: e per stopparla

source: G3W-ADMIN is a django application so is possibile run app by standard django manage.py commands
it: G3W-ADMIN è un'applicazione Django, quindi è possibile eseguire l'applicazione con i comandi standard manage.py di Django

source: Deploy G3W-SUITE
it: Deploy di G3W-SUITE

source: As other Django application, G3W-SUITE can be deployed by its wsgi capabilities. On the web if simple to find tutorial for deploy a Django application.
it: Come altre applicazioni Django, G3W-SUITE può essere implementato dalle sue funzionalità wsgi. Sul Web se semplice trovare tutorial per deployare un'applicazione Django.

source: The simpler way is to use Apache2 as server WEB and its mod_wsgi module.
it: Il modo più semplice è usare [Apache2](https://httpd.apache.org/) come WEB server e il suo modulo [mod_wsgi](https://en.wikipedia.org/wiki/Mod_wsgi).

source: Apache2 + mod_proxy + Uwsgi
it: Le soluzioni alternative sono:

source: Apache2 + mod_proxy + Gunicorn
it: [Apache2](https://httpd.apache.org/) + [mod_proxy](https://httpd.apache.org/docs/2.4/mod/mod_proxy.html) + [Gunicorn](http://gunicorn.org/)

source: Nginx + Uwsgi
it: [Nginx](https://nginx.org/) + [Uwsgi](https://uwsgi-docs.readthedocs.io/en/latest/)

source: Nginx + Gunicorn
it: [Nginx](https://nginx.org/) + [Gunicorn](http://gunicorn.org/)

source: Manual installation steps
it: Passi per l'installazione manuale

source: The preferred installation is by using the paver script as mentioned above, but in case you need to customize the installation process, here are the build and setup steps:
it: L'installazione consigliata è basata sull'utilizzo dello script paver come menzionato sopra, ma nel caso in cui sia necessario personalizzare il processo di installazione, ecco i passaggi di costruzione e configurazione:

source: Build static js code
it: Creazione static js code

source: Make sure build components are available in static and collected later
it: Assicurati che i build component siano disponibili in modalità statica e raccolti in un secondo momento

source: Install requirements
it: Requisiti di installazione

source: Possibily within a virtual env:
it: Probabilmente all'interno di un virtual env:

source: Django setup
it: Settaggio di Django

source: Install some fixtures for EPSG and other suite options:
it: Installa alcuni dispositivi per EPSG e altre opzioni di suite:

source: Sync menu tree items (re-run this command in case you installed optional modules and they are not visible in the admin menu tree):
it: Sincronizza le voci dell'albero dei menu (riesegui questo comando nel caso in cui tu abbia installato moduli opzionali e non siano visibili nella struttura dei menu dell'amministratore):

source: CI tests are automatically run on CircleCI for the dev branch only.
it: I test CI vengono eseguiti automaticamente su CircleCI solo per il dev branch.

source: The Docker compose configuration used in the CI tests is available at docker-compose.yml.
it: La configurazione del Docker Compose utilizzata nei test CI è disponibile su [docker-compose.yml](https://g3w-suite.readthedocs.io/it/latest/docker-compose.yml).

source: Another configuration for running local tests is provided with docker-compose-local.yml and can also be used for local testing by running:
it: Un'altra configurazione per l'esecuzione dei test locali è fornita con [docker-compose-local.yml](https://g3w-suite.readthedocs.io/it/latest/docker-compose-local.yml) e può essere utilizzata anche per i test locali eseguendo:

source: The testing image is built from the dependency image and it will run all install and build steps from the local repository.
it: L'immagine di prova viene creata dall'immagine di dipendenza e eseguirà tutti i passaggi di installazione e compilazione dal repository locale.

source: The dependency image is built from the Dockerfile.deps.
it: L'immagine di dipendenza viene creata da [Dockerfile.deps](https://g3w-suite.readthedocs.io/it/latest/ci_scripts/Dockerfile).
