export default {
  title: 'Диаграми',
  no_plots : 'Няма диаграма. Добавете поне една графика.',
  no_data: "Няма налични данни",
  tooltip: {
    show_all_features_on_map: "Филтриране на графиките по геометрии, видими на картата",
    filter_chart: "Филтриране на графики по избрани геометрии/записи"
  },
  filters: {
    in_bbox: "Данните, филтрирани по геометрии, видими на картата",
    filtertoken: "Данни, филтрирани по избрани геометрии/записи",
    in_bbox_filtertoken: "Данните са филтрирани по избрани геометрии/записи и са видими на картата",
    relation: {
      in_bbox: "Данните, филтрирани по (родителски) геометрии, видими на картата",
      filtertoken: "Данни, филтрирани по избрани (родителски) геометрии/записи",
      in_bbox_filtertoken: "Данните са филтрирани по избрани (родителски) геометрии/записи и са видими на картата"
    }
  }
}