export default {
  title: 'Діаграми',
  no_plots : 'Без діаграм. Додайте принаймні одну діаграму.',
  no_data: "Дані не доступні",
  tooltip: {
    show_all_features_on_map: "Фільтрувати всі діаграми відповідно до видимих на мапі об'єктів",
    filter_chart: "Фільтрувати діаграми відповідно до вибраних об'єктів/записів"
  },
  filters: {
    in_bbox: "Діаграму відфільтровано відповідно до видимих на мапі об'єктів",
    filtertoken: "Діаграму відфільтровано відповідно до вибраних об'єктів/записів",
    in_bbox_filtertoken: "Діаграму відфільтровано відповідно до вибраних та видимих на мапі об'єктів/записів",
    relation: {
      in_bbox: "Діаграму відфільтровано відповідно до видимих на мапі опорних (батьківських) об'єктів",
      filtertoken: "Діаграму відфільтровано відповідно до вибраних опорних (батьківських) об'єктів/записів",
      in_bbox_filtertoken: "Діаграму відфільтровано відповідно до вибраних та видимих на мапі опорних (батьківських) об'єктів/записів"
    }
  }
}